/*
оступ к файловой системе
В отличие от браузерного JavaScript, у Node.js есть доступ к файловой системе.
Например, мы легко можем узнать абсолютный путь к директории, в которой находится наш файл. Для этого откроем файл test.js и напишем в нём код
console.log(__dirname);
Откроем терминал и запустим файл

node test
В консоль выведется абсолютный путь к директории с файлом test.js. Теперь выведем абсолютный путь к файлу. Для этого в файле test.js добавим строку
console.log(__filename);
Теперь в консоль выводится абсолютный путь к файлу test.js вместе с его именем.

Задание
Напишите программу, которая возвращает путь к папке, если запускается с флагом '-d',
или путь к файлу, если запускается с флагом '-f'. 
Если файл запускается без флага или с флагом, отличным от указанных в задании, 
выводится предложение запустить программу с флагом '-d' или '-f'.
*/

const { stdin, stdout, exit } = process;
const flag = process.argv[2];
console.log(flag)
const allowArgs = ['-d', '-f'];
if (!allowArgs.includes(flag) || !flag) {
  stdout.write('Pleace write again with correct flags..\n');
  exit();
}
if (flag === '-d') {
  stdout.write(`${__dirname}\n`);
  exit();
} else {
  stdout.write(`${__filename}\n`);
  exit();
}