/*
  Task Application GitHub

  Создадим консольное приложение, которое в качестве аргумента командной строки будет 
  принимать имя пользователя GitHubи выводить список репозиториев этого пользователя.

  Для этого воспользуемся GitHub API. По запросу https://api.github.com/users/USERNAME/repos 
  возвращается список репозиториев пользователя, USERNAME которого указан в ссылке.
	
  1. Начнём работу с создания нового Node.js приложения.
  Создадим папку github-app, откроем её в VS Code, в терминале выполним команду
  npm init -y
  Создадим два файла:

  app.js - основной файл приложения
  github.js - в нём пишем логику взаимодействия с API.

  2. Начнём с файла app.js
  Импортируем в него модуль github. Так как это самостоятельно созданный модуль, в качестве параметра метода require() указываем путь к файлу с кодом модуля
  const github = require('./github');
  Создадим переменную username в которой сохраним аргумент командной строки, переданный при запуске программы

  const username = process.argv[2];

  Используем импортированный объект github, у которого есть свойство getRepos() - функция, возвращающая список репозиториев пользователя.
  Параметры функции getRepos() - username - имя пользователя и функция обратного вызова, принимающая два параметра - error - ошибка и repos - полученные данные, в нашем случае - список репозиториев.
  В теле функции обработаем ошибку и выведем в консоль названия репозиториев
*/

const github = require('./github');
const username = process.argv[2];

github.getRepos(username, (error, repos) => {
  if (error) return console.error(error.message);

  repos.forEach(repo => console.log(repo.name));
});